app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 18]]
INSERT INTO "reviews" ("thoughts", "rating", "restaurant_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["thoughts", "so so"], ["rating", 3], ["restaurant_id", 172], ["user_id", 209], ["created_at", "2015-02-20 23:24:59.494278"], ["updated_at", "2015-02-20 23:24:59.494278"]]
---
  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    @review = @restaurant.reviews.new(review_params)
    @review.user = current_user
    if @review.save